---

C#Visual BasicVisual C++

Revit 2024 API
---
RibbonItem..::..GetContextualHelp Method
RibbonItem Class See Also Send Feedback
---

Gets the contextual help bound with this control.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013

# Syntax

C#
---

    public ContextualHelp GetContextualHelp()

Visual Basic
---

    Public Function GetContextualHelp As ContextualHelp

Visual C++
---

    public:
    ContextualHelp^ GetContextualHelp()

#### Return Value

The contextual help assigned to the item, or nullNothingnullptra null reference (Nothing in Visual Basic) if there is no binding assigned.

# See Also

RibbonItem Class

Autodesk.Revit.UI Namespace